#############################################################
#		테마 정보
#############################################################
#
# [Theme-([Index])]
#
# PreviewImgIdx 는 대기방 가운데에 이미지 Map/Room/Terrain/Preview.smf <- 수정 대상


[Theme-0]
Id=0
Name=포레스트
PreviewImgIdx=0
BgmFileName=Forest00
BgmTitle=리디아 숲속의 축제
BgmAuthor=Danbi


[Theme-1]
Id=1
Name=메가트론
PreviewImgIdx=1
BgmTitle=메가트론의 비밀
BgmAuthor=KmBox
BgmFileName=Megatron00


[Theme-2]
Id=2
Name=에스페란
PreviewImgIdx=2					# <- 이거 어떻게좀 바꿔야함
BgmTitle=에스페란의 위험
BgmAuthor=Danbi
BgmFileName=Esperan00


[Theme-3]
Id=3
Name=아이스리아
PreviewImgIdx=3
BgmTitle=얼음의 성 아이스리아
BgmAuthor=Danbi
BgmFileName=Iceria00


[Theme-4]
Id=4
Name=도미르
PreviewImgIdx=4
BgmAuthor=Danbi
BgmTitle=눈부신 도미르섬
BgmFileName=Domir00

[Theme-5]
Id=5
Name=카멜리아
PreviewImgIdx=5
BgmAuthor=Danbi
BgmTitle=카멜리안 나이트
BgmFileName=Camel00


[Theme-6]
Id=6
Name=불프로그
PreviewImgIdx=6
BgmAuthor=Danbi
BgmTitle=BullFrog
BgmFileName=(NONE)
## Main BGM은 스크립트에서 변경


[Theme-7]
Id=7
Name=드라카
PreviewImgIdx=7
BgmAuthor=Danbi
BgmTitle=Drako
BgmFileName=(NONE)
## Main BGM은 스크립트에서 변경

[Theme-8]
Id=8
Name=비밀의 섬
PreviewImgIdx=9
BgmAuthor=Danbi
BgmTitle=Island
BgmFileName=(NONE)
# Main BGM은 스크립트에서 변경

[Theme-9]
Id=9
Name=로즈가든
PreviewImgIdx=8
BgmAuthor=Danbi
BgmTitle=왕녀의 외출
BgmFileName=Garden00

[Theme-10]
Id=10
Name=자미로건쉽
PreviewImgIdx=10
BgmAuthor=Danbi
BgmTitle=Island
BgmFileName=(NONE)
# Main BGM은 스크립트에서 변경

[Theme-11]
Id=11
Name=다크나이트
PreviewImgIdx=12
BgmAuthor=Danbi
BgmTitle=UnderWorld
BgmFileName=(NONE)
# Main BGM은 스크립트에서 변경

[Theme-12]
Id=12
Name=카멜 지하유적
PreviewImgIdx=13
BgmAuthor=Danbi
BgmTitle=UnderWorld
BgmFileName=Quest05-Stage

[Theme-13]
Id=13
Name=스페셜
PreviewImgIdx=14
BgmAuthor=Danbi
BgmTitle=
BgmFileName=

[Theme-14]
Id=14
Name=브레그마
PreviewImgIdx=15
BgmAuthor=Danbi
BgmTitle=브레그마
BgmFileName=(NONE)
# Main BGM은 스크립트에서 변경

[Theme-15]
Id=15
Name=망자의 사막
PreviewImgIdx=16
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=BGM-Game-Desert00
# Main BGM은 스크립트에서 변경

#############################################################
#		맵 정보
#############################################################
#
# [ThemeIndex-MapIndex]
#
#   프로퍼티          :    설명                             (디폴트값)
#	MinUser         : 방의 최소 유저수                       (1)
#	MaxUser         : 방의 최대 유저수                       (2)
#	MinLevel        : 맵을 플레이할 수 있는 최소레벨         (1)
#	MapDisplayName  : 맵의 이름                              ()
#	MapFileName     : 맵 파일이름                            ()
#	AvailableMode   : 맵을 플레이할 수 있는 모드             ([Pvp],[Hunting])
#	RequestedClearQuestId
#	CursorColor     : 커서 색깔                              (FFFFFFFF)
#	RequiredQuestClear : 퀘스트 클리어 조건(퀘스트Id)		 (0)    		 1:개굴 2:용 3:섬 4:비행기 5:말 6:해
#
#  (퀘스트)
#   QuestId         : 퀘스트 Id


####################
# 포레스트 테마

[0-0]
MapFileName=Forest_b
MapDisplayName=포레스트 입구
CursorColor=FFFFFFFF
MaxUser=4
OpenLocale=3

[0-1]
MapFileName=Forest00
MapDisplayName=포레스트 오크나무
CursorColor=FFFFFFFF
MinLevel=3
OpenLocale=3

[0-2]
MapFileName=Forest02
MapDisplayName=포레스트 달팽이 연못
CursorColor=FFFFFFFF
MinLevel=4
OpenLocale=3

[0-3]
MapFileName=Forest_M00
MapDisplayName=포레스트 무투장
CursorColor=FFFFFFFF
AvailableMode=[Mutu]

[0-4]
MapFileName=Forest03
MapDisplayName=포레스트 개미지옥
CursorColor=FFFFFFFF
MinLevel=8
MaxUser=4
FallDownEffectFileName=Effects/Environment/Efx/AntLionDie.efx

####################
# 메가트론 테마

[1-0]
MapFileName=Megatron_b
MapDisplayName=메가트론 입구
CursorColor=FFFFFFFF
MaxUser=4
OpenLocale=3


[1-1]
MapFileName=Megatron01
MapDisplayName=메가트론 고철처리장
CursorColor=FFFFFFFF
MinLevel=3
OpenLocale=3


[1-2]
MapFileName=Megatron00
MapDisplayName=메가트론 하수처리장
CursorColor=FFFFFFFF
MinLevel=6
OpenLocale=3


[1-3]
MapFileName=Megatron_M00
MapDisplayName=메가트론 무투장
CursorColor=FFFFFFFF
AvailableMode=[Mutu]

####################
# 에스페란 테마

[2-0]
MapFileName=Esperan_b
MapDisplayName=에스페란 입구
CursorColor=FFFFFFFF
MaxUser=4
OpenLocale=3

[2-1]
MapFileName=Esperan00
MapDisplayName=에스페란 용암동굴
CursorColor=FFFFFFFF
MinLevel=4
OpenLocale=3

[2-2]
MapFileName=Esperan03
MapDisplayName=에스페란 돌다리
CursorColor=FFFFFFFF
MinLevel=8
OpenLocale=3

[2-3]
MapFileName=Esperan_M00
MapDisplayName=에스페란 무투장
CursorColor=FFFFFFFF
AvailableMode=[Mutu]

[2-4]
MapFileName=Esperan04
MapDisplayName=에스페란 해골성
CursorColor=FFFFFFFF
MinLevel=8
MaxUser=4

####################
# 아이스리아 테마

[3-0]
MapFileName=Iceria_b
MapDisplayName=아이스리아 입구
CursorColor=FFFF4040
MaxUser=4
MinLevel=3
OpenLocale=3

[3-1]
MapFileName=Iceria00
MapDisplayName=아이스리아 영웅의 다리
CursorColor=FFFF4040
MinLevel=6
OpenLocale=3

[3-2]
MapFileName=Iceria02
MapDisplayName=아이스리아 북문
CursorColor=FFFF4040
MinLevel=11
OpenLocale=3


[3-3]
MapFileName=Iceria_M00
MapDisplayName=아이스리아 무투장
CursorColor=FFFF4040
AvailableMode=[Mutu]

[3-4]
MapFileName=Iceria03
MapDisplayName=아이스리아 얼음탑
CursorColor=FFFF4040
MinLevel=11

# 도미르 테마

[4-0]
MapFileName=Domir_Newbie
MapDisplayName=수류탄 훈련장
CursorColor=FFFF4040
MaxUser=2
MinLevel=1
OpenLocale=3

[4-1]
MapFileName=Domir_b
MapDisplayName=도미르 입구
CursorColor=FFFF4040
MaxUser=4
MinLevel=6
OpenLocale=3

[4-2]
MapFileName=Domir03
MapDisplayName=도미르 캠프장
CursorColor=FFFF4040
MinLevel=11
OpenLocale=3

[4-3]
MapFileName=Domir00
MapDisplayName=도미르 카스카해변
CursorColor=FFFF4040
MinLevel=13

[4-4]
MapFileName=Domir_M00
MapDisplayName=도미르 무투장
CursorColor=FFFF4040
AvailableMode=[Mutu]

####################
# 카멜리아 테마

[5-0]
MapFileName=Camel00
MapDisplayName=카멜궁 1층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=8


[5-1]
MapFileName=Camel01
MapDisplayName=카멜궁 2층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=16


[5-2]
MapFileName=Camel02
MapDisplayName=카멜궁 3층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=21

[5-3]
MapFileName=Camel_M00
MapDisplayName=카멜궁 무투장
CursorColor=FFFFFFFF
MaxUser=6
AvailableMode=[Mutu]

####################
# 로즈가든 테마

[9-0]
MapFileName=Garden00
MapDisplayName=로즈가든 광장
CursorColor=FFFF4040
MaxUser=6
MinLevel=11

[9-1]
MapFileName=Garden01
MapDisplayName=로즈가든 비밀의 화원
CursorColor=FFFF4040
MaxUser=6
MinLevel=16

[9-2]
MapFileName=Garden_M00
MapDisplayName=로즈가든 무투장
CursorColor=FFFF4040
MaxUser=6
AvailableMode=[Mutu]

####################
# 카멜 지하유적 테마

[12-0]
MapFileName=Newbe2-1
MapDisplayName=지하유적 입구
CursorColor=FFFFFF40
MaxUser=2
OpenLocale=3


[12-1]
MapFileName=CamelCulvert00
MapDisplayName=지하유적 지하 1층
CursorColor=FFFF4040
MaxUser=6
MinLevel=8
OpenLocale=3


[12-2]
MapFileName=CamelCulvert01
MapDisplayName=지하유적 지하 2층
CursorColor=FFFFFF40
MaxUser=6
MinLevel=13
OpenLocale=3


[12-3]
MapFileName=CamelCulvert_M00
MapDisplayName=지하유적 무투장
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]


[12-4]
MapFileName=CamelCulvert02
MapDisplayName=지하유적 지하 3층
CursorColor=FFFFFF40
MaxUser=6
Minlevel=15

#스페셜 테마
[13-0]
MapFileName=Boss_Bullfrog_M00
MapDisplayName=불프로그
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=BullFrog
BgmFileName=Boss01
RequiredQuestClear=1

[13-1]
MapFileName=Boss_Draka_M00
MapDisplayName=드라카
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=Draka
BgmFileName=Quest02-Esperan
RequiredQuestClear=2

[13-2]
MapFileName=Boss_Island_M00
MapDisplayName=비밀의 섬
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=Island
BgmFileName=Quest03-boss
RequiredQuestClear=3

[13-3]
MapFileName=Boss_Airship_M00
MapDisplayName=자미로건쉽
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=GunShip
BgmFileName=Quest04-boss
RequiredQuestClear=4

[13-4]
MapFileName=Boss_Darknight_M00
MapDisplayName=다크나이트
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=UnderWorld
BgmFileName=Quest05-boss
RequiredQuestClear=5

[13-5]
MapFileName=Boss_Bregma_M00
MapDisplayName=브레그마
CursorColor=FFFFFF40
MaxUser=6
AvailableMode=[Mutu]
BgmAuthor=Danbi
BgmTitle=브레그마
BgmFileName=Quest06-boss
RequiredQuestClear=6

#망자의 사막
[15-0]
MapFileName=Desert01
MapDisplayName=망각의 시간
CursorColor=FFFFFF40
MaxUser=4
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=12

[15-1]
MapFileName=Desert03
MapDisplayName=현자의 돌
CursorColor=FFFFFF40
MaxUser=6
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=14

[15-2]
MapFileName=Desert02
MapDisplayName=고요의 땅
CursorColor=FFFFFF40
MaxUser=6
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=16


###############################################################################
#
#
#	NewPvP용 맵이다!! [ThemeIdx-100 + x]
#   NewPvp 맵인덱스는 100번대
#



# 포레스트 테마

[0-100]
MapFileName=Forest_b:NewPvp
MapDisplayName=포레스트 입구
CursorColor=FFFFFFFF
#MinLevel=1
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.3
OpenLocale=3

[0-101]
MapFileName=Forest00:NewPvp
MapDisplayName=포레스트 오크나무
CursorColor=FFFFFFFF
MinLevel=3
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3

[0-102]
MapFileName=Forest02:NewPvp
MapDisplayName=포레스트 달팽이 연못
CursorColor=FFFFFFFF
MinLevel=4
AvailableMode=[NewPvp]
#ZoomRatio=1.2
OpenLocale=3

[0-103]
MapFileName=Forest03:NewPvp
MapDisplayName=포레스트 개미지옥
CursorColor=FFFFFFFF
MinLevel=8
AvailableMode=[NewPvp]
#ZoomRatio=1.2
FallDownEffectFileName=Effects/Environment/Efx/AntLionDie.efx
MaxUser=4


# 메가트론 테마

[1-100]
MapFileName=Megatron_b:NewPvp
MapDisplayName=메가트론 입구
CursorColor=FFFFFFFF
#MinLevel=1
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.3
OpenLocale=3


[1-101]
MapFileName=Megatron01:NewPvp
MapDisplayName=메가트론 고철처리장
CursorColor=FFFFFFFF
MinLevel=3
AvailableMode=[NewPvp]
#ZoomRatio=1.2
OpenLocale=3


[1-102]
MapFileName=Megatron00:NewPvp
MapDisplayName=메가트론 하수처리장
CursorColor=FFFFFFFF
MinLevel=6
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3




# 에스페란 테마

[2-100]
MapFileName=Esperan_b:NewPvp
MapDisplayName=에스페란 입구
CursorColor=FFFFFFFF
MinLevel=1
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.3
OpenLocale=3


[2-101]
MapFileName=Esperan00:NewPvp
MapDisplayName=에스페란 용암동굴
CursorColor=FFFFFFFF
MinLevel=4
AvailableMode=[NewPvp]
#ZoomRatio=1.1
OpenLocale=3


[2-102]
MapFileName=Esperan03:NewPvp
MapDisplayName=에스페란 돌다리
CursorColor=FFFFFFFF
MinLevel=8
AvailableMode=[NewPvp]
#ZoomRatio=1.1
OpenLocale=3


[2-103]
MapFileName=Esperan04:NewPvp
MapDisplayName=에스페란 해골성
CursorColor=FFFFFFFF
MinLevel=8
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.1



# 아이스리아 테마

[3-100]
MapFileName=Iceria_b:NewPvp
MapDisplayName=아이스리아 입구
CursorColor=FFFF4040
MinLevel=3
MaxUser=4
AvailableMode=[NewPvp]
#ZoomRatio=1.3
OpenLocale=3


[3-101]
MapFileName=Iceria00:NewPvp
MapDisplayName=아이스리아 영웅의 다리
CursorColor=FFFF4040
MinLevel=6
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3


[3-102]
MapFileName=Iceria02:NewPvp
MapDisplayName=아이스리아 북문
CursorColor=FFFF4040
MinLevel=11
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3

[3-103]
MapFileName=Iceria03:NewPvp
MapDisplayName=아이스리아 얼음탑
CursorColor=FFFF4040
MinLevel=11
AvailableMode=[NewPvp]
#ZoomRatio=1.0
#OpenLocale=3


# 도미르 테마

[4-100]
MapFileName=Domir_Newbie:NewPvp
MapDisplayName=수류탄 훈련장
CursorColor=FFFF4040
MaxUser=2
MinLevel=1
AvailableMode=[NewPvp]
OpenLocale=3


[4-101]
MapFileName=Domir_b:NewPvp
MapDisplayName=도미르 입구
CursorColor=FFFF4040
MaxUser=6
MinLevel=6
AvailableMode=[NewPvp]
#ZoomRatio=1.2
OpenLocale=3


[4-102]
MapFileName=Domir03:NewPvp
MapDisplayName=도미르 캠프장
CursorColor=FFFF4040
MinLevel=11
AvailableMode=[NewPvp]
#ZoomRatio=1.0
OpenLocale=3


[4-103]
MapFileName=Domir00:NewPvp
MapDisplayName=도미르 카스카해변
CursorColor=FFFF4040
MinLevel=13
AvailableMode=[NewPvp]
#ZoomRatio=1.0



# 카멜궁 테마

[5-100]
MapFileName=Camel00:NewPvp
MapDisplayName=카멜궁 1층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=8
AvailableMode=[NewPvp]
#ZoomRatio=1.0


[5-101]
MapFileName=Camel01:NewPvp
MapDisplayName=카멜궁 2층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=16
AvailableMode=[NewPvp]
#ZoomRatio=1.0

[5-102]
MapFileName=Camel02:NewPvp
MapDisplayName=카멜궁 3층
CursorColor=FFFFFFFF
MaxUser=6
MinLevel=21
AvailableMode=[NewPvp]
#ZoomRatio=1.0



# 로즈가든 테마

[9-100]
MapFileName=Garden00:NewPvp
MapDisplayName=로즈가든 광장
CursorColor=FFFF4040
MaxUser=6
MinLevel=11
AvailableMode=[NewPvp]
#ZoomRatio=1.0

[9-101]
MapFileName=Garden01:NewPvp
MapDisplayName=로즈가든 비밀의 화원
CursorColor=FFFF4040
MaxUser=6
MinLevel=16
AvailableMode=[NewPvp]
#ZoomRatio=1.0




# 카멜 지하유적 테마

[12-100]
MapFileName=Newbe2-1:NewPvp
MapDisplayName=지하유적 입구
CursorColor=FFFFFF40
MaxUser=2
AvailableMode=[NewPvp]
OpenLocale=3


[12-101]
MapFileName=CamelCulvert00:NewPvp
MapDisplayName=지하유적 지하 1층
CursorColor=FFFFFF40
MaxUser=6
MinLevel=8
AvailableMode=[NewPvp]
OpenLocale=3

[12-102]
MapFileName=CamelCulvert01:NewPvp
MapDisplayName=지하유적 지하 2층
CursorColor=FFFFFF40
MaxUser=6
MinLevel=13
AvailableMode=[NewPvp]
OpenLocale=3

[12-103]
MapFileName=CamelCulvert02:NewPvp
MapDisplayName=지하유적 지하 3층
CursorColor=FFFFFF40
MaxUser=6
MinLevel=15
AvailableMode=[NewPvp]


#망자의 사막
[15-100]
MapFileName=Desert01:NewPvp
MapDisplayName=망각의 시간
CursorColor=FFFFFF40
MaxUser=4
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=12
AvailableMode=[NewPvp]

[15-101]
MapFileName=Desert03:NewPvp
MapDisplayName=현자의 돌
CursorColor=FFFFFF40
MaxUser=6
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=14
AvailableMode=[NewPvp]

[15-102]
MapFileName=Desert02:NewPvp
MapDisplayName=고요의 땅
CursorColor=FFFFFF40
MaxUser=6
BgmAuthor=Danbi
BgmTitle=망자의 사막
BgmFileName=Desert00
MinLevel=16
AvailableMode=[NewPvp]

###############################################################################
#
#
#	Quest용 맵이다!!
#	[QuestIdx-MapSeqIdx]
#  퀘스트 맵 인덱스는 200번대
#


[14-200]		# Quest 6 브레그마
MapFileName=Quest06_boss
MapDisplayName=브레그마
CursorColor=FFFFFF40
MaxUser=4
AvailableMode=[Quest]
QuestId=6
Description=Quest6
